Repository: 84000/data-translation-memory
Catalog: Toh_96-The_Miraculous_Play_of_Manjusri-v2.tmx
Source language: bo
Languages: en

source: རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་མེད་པ་ལ་ནི་རབ་ཏུ་འབྱུང་བ་ཅི་ཡང་མེད་དོ། །
en: There is no going forth in the absence of insight into freedom.”

source: བུ་མོས་སྨྲས་པ། འཇམ་དཔལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་རབ་ཏུ་འབྱུང་བ་གཞན་ལ་རག་ལས་པ་མ་མཆིས་པ་ལགས།
en: “How, Mañjuśrī, do bodhisatvas become independent in their going forth?” asked the girl.

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་གཞན་གྱི་དྲིང་མི་འཇོག་པས་ན་གཞན་ལ་རག་ལས་པ་མེད་པ་སྟེ།
en: “Girl,” replied Mañjuśrī, “bodhisatvas are independent as they do not depend on anyone else.

source: རང་གི་ཀུན་ཤེས་པའི་ཡེ་ཤེས་ཀྱིས་འདིས་གང་ཅི་ཤེས་པ་དེ་བདག་གིས་ཀྱང་ཤེས་ལ།
en: By means of their own comprehension and knowledge, whatever they know, they know themselves.

source: འདི་གང་ཅི་སྨྲ་བ་དེ་བདག་ཀྱང་སྨྲའོ་ཞེས་གཞན་དག་གི་ངོར་མི་ལྟ་བས་ན།
en: Whatever they say, they say themselves.

source: གཞན་ལ་རག་ལས་པ་མེད་པ་ཡིན་ནོ། །
en: Thus they are independent because they are not compliant.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་རབ་ཏུ་འབྱུང་བའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན། ལེགས་པར་བཤད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱས་རང་རང་གི་གོས་དང་རྒྱན་ཐམས་ཅད་ལུས་ལས་ཕུད་དེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕུལ་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: When the princely Mañjuśrī had taught this exposition of the Dharma consisting of this passage on going forth, because it was so well formulated five hundred bodhisatvas took the clothes and ornaments off their bodies and declared,

source: འཇམ་དཔལ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རབ་ཏུ་འབྱུང་བ་ལེགས་པར་བཤད་དེ། བདག་ཅག་རྣམས་ཀྱིས་ཀྱང་རབ་ཏུ་འབྱུང་བ་འདི་བསྒྲུབ་པར་བགྱིའོ། །
en: “The going forth of the bodhisatvas as you have taught it was so well formulated that we also wish to attain that going forth.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The princely Mañjuśrī then said to the courtesan’s daughter Suvarṇottama­prabhāśrī,

source: བུ་མོ་ཁྱོད་རྟའི་ཤིང་རྟ་འདི་ལ་ཞོན་ལ། ཚོང་དཔོན་གྱི་བུ་འཇིགས་བྱིན་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་ཡོངས་སུ་སྨིན་པར་གྱིས་ཤིག་དང་།
en: “Girl, get into the carriage and, out of compassion, bring the banker’s son Bhayadatta to maturation.

source: དེ་ཉིད་ཀྱིས་ཁྱོད་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་པར་འགྱུར་རོ། །
en: By this, you will go forth and attain full ordination.”

source: དེ་ནས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Then the great crowd of people thought,

source: འདོད་ཆགས་དང་བྲལ་བ་དང་། འདོད་ཆགས་དང་མ་བྲལ་བ་གཉིས་ལྷན་ཅིག་གནས་སུ་ཇི་ལྟར་རུང་སྙམ་མོ། །
en: “How can it be right that one without desire remains in the company of one who is not without desire?”

source: དེ་ནས་བུ་མོ་དེས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་གི་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་སེམས་ཀྱིས་ཤེས་ནས། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The girl knew the thoughts of the great crowd of people, and she said to them,

source: གྲོགས་པོ་དག་འདོད་ཆགས་དང་བྲལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདོད་ཆགས་དང་བཅས་པའི་སེམས་ཅན་རྣམས་དང་ལྷན་ཅིག་གནས་ཀྱང་ཁ་ན་མ་ཐོ་བ་མེད་ལ།
en: “Friends, even though bodhisatvas who are without desire remain in the company of beings who are full of desire, they are without blemish.

source: འདོད་ཆགས་དང་བཅས་པའི་སེམས་ཅན་རྣམས་ཀྱང་འདུལ་བར་བྱེད་དོ། །
en: They educate those beings who are full of desire.

source: གྲོགས་པོ་དག་ཞེ་སྡང་དང་བྲལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཞེ་སྡང་དང་བཅས་པའི་སེམས་ཅན་རྣམས་དང་ལྷན་ཅིག་གནས་ཀྱང་ཁ་ན་མ་ཐོ་བ་མེད་ལ་
en: Friends, even though bodhisatvas who are without aversion stay in the company of beings who are full of aversion, they are without blemish.

source: ཞེ་སྡང་དང་བཅས་པའི་སེམས་ཅན་རྣམས་ཀྱང་འདུལ་བར་བྱེད་དོ། །
en: They educate those beings who are full of aversion.

source: གྲོགས་པོ་དག་གཏི་མུག་དང་བྲལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་གཏི་མུག་དང་བཅས་པའི་སེམས་ཅན་རྣམས་དང་ལྷན་ཅིག་གནས་ཀྱང་ཁ་ན་མ་ཐོ་བ་མེད་ལ་
en: Friends, even though bodhisatvas who are without bewilderment stay in the company of beings who are full of bewilderment, they are without blemish.

source: གཏི་མུག་དང་བཅས་པའི་སེམས་ཅན་རྣམས་ཀྱང་འདུལ་བར་བྱེད་དོ། །
en: They educate those beings who are full of bewilderment.

source: གྲོགས་པོ་དག་ཉོན་མོངས་པ་དང་བྲལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཉོན་མོངས་པ་དང་བཅས་པའི་སེམས་ཅན་རྣམས་དང་ལྷན་ཅིག་གནས་ཀྱང་ཁ་ན་མ་ཐོ་བ་མེད་ལ་
en: Friends, even though bodhisatvas who are without afflicted mental states stay in the company of beings who are full of afflicted mental states, they are without blemish.

source: ཉོན་མོངས་པ་དང་བཅས་པའི་སེམས་ཅན་རྣམས་ཀྱང་འདུལ་བར་བྱེད་དོ། །
en: They educate those beings who are full of afflicted mental states.

source: གྲོགས་པོ་དག་འདི་ལྟ་སྟེ་དཔེར་ན། མ་ནི་བུ་དང་ལྷན་ཅིག་གནས་ཀྱང་ཆགས་པ་མེད་དོ། །
en: “Friends, just as a mother has no desire for her son even though she dwells together with him,

source: གྲོགས་པོ་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ལྷན་ཅིག་གནས་ཀྱང་ཆགས་པ་མེད་དོ། །
en: in the same way, friends, bodhisatvas are not desirous of living beings, although they dwell together with them.

source: གྲོགས་པོ་དག་འདི་ལྟ་སྟེ་དཔེར་ན། བཅིངས་པ་ལས་བཀྲོལ་བའི་མི་ནི་འདོད་ཆགས་ཀྱི་ཀུན་དུ་སྤྱད་པ་ལ་མི་སྤྱོད་དོ། །
en: Friends, just as a man who is shut up in prison does not act according to habits of desire,

source: གྲོགས་པོ་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཁམས་གསུམ་པ་དག་འཆིང་བ་དང་འོབས་ལྟ་བུར་འདུ་ཤེས་པས་ཆགས་པ་མེད་དོ། །
en: in the same way, friends, bodhisatvas are not attached to concepts in the threefold world, which is like a pit in a prison.”

source: དེ་ནས་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་ཆོས་ཀྱི་འབབ་སྟེགས་སུ་ནི་ཞུགས། གཏིང་ནི་རྙེད། ཐང་ལ་ནི་ཕྱིན།
en: Then the courtesan’s daughter Suvarṇottama­prabhāśrī stood on the Dharma dismounting step, attained the profound, and stepped down on to the earth.

source: མ་རིག་པའི་མུན་པ་དང་ནི་བྲལ་ཏེ། སྲིད་པའི་སྐྱོན་གྱི་ཉོན་མོངས་པ་འཇིགས་པར་ལྟ་བ་ནི་ལེགས་པར་མཐོང་ནས།
en: Freed from the obscuration of ignorance, she had fully realized the view of the fearfulness of the afflicted mental states that result from the imperfections of existence.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཤིང་རྟ་ལ་ཞོན་ཀར་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: She bowed her head to the feet of the princely Mañjuśrī, circumambulated him three times, and then expressed herself in verse by the carriage steps:

source: རང་བཞིན་རྣམ་དག་ཆགས་པས་མ་ཆགས་ཤིང་། །
en: “Being essentially pure, I am not impassioned.

source: རྟག་ཏུ་བྱམས་སེམས་སྣང་བས་སྡང་བ་མེད། །
en: Due to my constant friendliness, I am not affected by aversion.

source: ཤེས་རབ་སྣང་ཤར་གཏི་མུག་རྨོངས་བྲལ་བ། །
en: Because of the light of my insight, I am not bewildered by delusion,

source: ཉོན་མོངས་མེད་པར་ཤིང་རྟ་བཞོན་པར་བྱ། །
en: And I will mount this carriage.

source: གང་གིས་སྔོན་ཆད་བདག་ནི་རྒྱལ་གྱུར་ཅིང་། །
en: “That which previously overpowered me

source: ནོར་ཆགས་ཚོང་དཔོན་བུ་དང་ལྷན་ཅིག་ཏུ། །
en: When I went to the park attached to riches,

source: ཤིང་རྟར་ཞུགས་ནས་སྐྱེད་མོས་ཚལ་སོང་བ། །
en: Riding in a carriage with a banker’s son—

source: འདོད་པའི་རྣམ་རྟོག་དེ་དག་གང་དུ་སོང་། །
en: That concept of passion, where has it gone?

source: ཇི་ལྟར་སྤྲིན་ཚོགས་སྟུག་པོས་ས་ཁེབས་ན། །
en: “The rays of the sun do not shine and do not burn

source: ཉི་མའི་འོད་ཟེར་ལྷམ་མེ་ལྷན་ནེར་མིན། །
en: When thick clouds cover the earth.

source: འོན་ཀྱང་འོད་ཟེར་དེ་དག་གར་མི་འགྲོ། །
en: Nevertheless, those rays do not go anywhere.

source: སྤྲིན་གྱིས་བསྒྲིབས་པས་སྣང་བ་མེད་དུ་ཟད། །
en: They simply do not shine while obscured by clouds.

source: དེ་བཞིན་ཉོན་མོངས་བསྒྲིབས་པས་བྱིས་པ་ཀུན། །
en: “In just the same way, all fools are obscured by the afflicted mental states.

source: ཤེས་རབ་སྣང་ལ་བློ་སྐྱེ་མེད་པ་ཡང་། །
en: Though understanding via the light of insight has not arisen,

source: ཤེས་རབ་ཡུལ་གང་ན་ཡང་གནས་པ་མེད། །
en: And the areas of insight are nowhere present,

source: ཉོན་མོངས་ཡོངས་སུ་ཤེས་པས་ཤེས་རབ་སྣང་། །
en: By comprehending the afflictions, insight shines forth.

source: ཉོན་མོངས་གང་ནས་འོང་བའང་མ་ཡིན་ཞིང་། །
en: “Afflicted mental states come from nowhere;

source: ཡུལ་གྱི་ཕྱོགས་ཆར་འགྲོ་བའང་མ་ཡིན་ཏེ། །
en: They do not depart to anywhere.

source: ཚུལ་བཞིན་མ་ཡིན་པ་ལས་ཉོན་མོངས་འབྱུང་། །
en: Afflicted mental states arise from the superficial;

source: ཚུལ་བཞིན་གྱིས་ནི་དེ་དག་འབྱུང་མི་འགྱུར། །
en: They do not arise from the fundamental.

source: བོར་བ་མེད་ཅིང་བླངས་པའང་ཡོད་མ་ཡིན། །
en: “There is no giving away and no grasping,

source: བསྐྱེད་པ་མེད་ཅིང་བཀག་པའང་ཡོད་མ་ཡིན། །
en: No arising and no destruction.

source: གཞན་ལ་མ་བྱིན་ཕྲོགས་པའང་མ་ཡིན་ཏེ། །
en: There is no giving to others or taking back, And

source: ཆོས་མཉམ་ཉིད་ཀྱིས་བདག་ཀྱང་རྣམ་པར་དག །
en: because of the sameness of all phenomena, I too am pure.

source: འབྲུ་མར་སྒྲོན་མ་མུན་པར་བྱུང་བ་ན། །
en: “When a sesame-oil lamp appears in the darkness,

source: མུན་པ་ཕྱོགས་སུ་འདོང་བ་མེད་པ་ལྟར། །
en: The darkness does not disperse in different directions.

source: ཤེས་རབ་ཀྱིས་ནི་མུན་པ་མེད་གྱུར་ན། །
en: When darkness is dispelled by insight

source: ཉོན་མོངས་ཟད་གྱུར་མེད་ཅིང་འབྱུང་བའང་མེད། །
en: There is no cessation of afflicted mental states and also no origination.

source: ཇི་ལྟར་སྨན་པས་ནད་པ་གསོ་བ་ན། །དེ་ཡི་ཁམས་ནི་འཇིག་པར་མི་བྱེད་ཀྱང་། །
en: “Doctors do not destroy the elements Of their patients’ bodies when they cure them.

source: དེ་ཡི་གློ་བུར་ནད་ནི་ཞི་བར་འགྱུར། །
en: They pacify the adventitious disease,

source: ནད་རྣམས་གཞན་ཡང་འབྱུང་བ་མེད་པ་ལྟར། །
en: And then other diseases do not arise.

source: དེ་བཞིན་སྨན་པའི་དམ་པ་འཇམ་དབྱངས་ཀྱིས། །
en: “In just the same way, the best of physicians, Mañjughoṣa,

source: རིགས་པའི་ཚུལ་མཁྱེན་སྦྱོར་བ་སྣ་ཚོགས་ཀྱིས། །
en: Who knows the appropriate methods,

source: སེམས་ཅན་ཉོན་མོངས་ཉེ་བར་ཞི་མཛད་ཀྱང་། །
en: Pacifies the afflicted mental states of beings by means of various practices,

source: ཆོས་རྣམས་རྣམ་པར་འཇིག་པར་མཛད་པ་མེད། །
en: But he does not make the phenomena disappear.

source: ཕུང་པོ་འདི་དང་ཁམས་རྣམས་འདི་དག་དང་། །སྐྱེ་མཆེད་འདི་རྣམས་གཞན་དུ་འགྱུར་བ་མེད། །
en: “These aggregates, sensory elements, and sense sources Do not change into something else.

source: གང་དག་སྔོན་ཆད་ཉེས་ལྡན་དུག་བཅས་པ། །དེ་དག་དེ་ནི་དུག་མེད་འགྱུར་བ་མེད། །
en: The factors that earlier had the poison of negativity Are now without poison and are unchanged.”

source: དེ་ནས་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་གྱིས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲས་ནས།
en: Then, when the courtesan’s daughter Suvarṇottama­prabhāśrī had spoken these verses,

source: ཡང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ།
en: she again bowed her head to the feet of the princely Mañjuśrī, and,

source: ཡང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བསྐོར་བ་བྱས་ནས།
en: after she had again circumambulated him,

source: ཚོང་དཔོན་གྱི་བུ་འཇིགས་བྱིན་དང་། ལྷན་ཅིག་ཏུ་ཤིང་རྟ་ལ་ཞོན་ཏེ། དེ་ལྟ་བུའི་འབྱོར་པ་ཉིད་ཀྱིས་སྐྱེད་མོས་ཚལ་གྱི་སར་སོང་ངོ་། །
en: she ascended into the carriage with the banker’s son Bhayadatta and proceeded to the park with all those riches.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཀྱང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན།
en: The princely Mañjuśrī too taught the whole of that assembly by means of conversation on the Dharma.

source: ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱས་སོ། །
en: He led them to take the conversation to heart, gave them cause to rejoice, and made them happy.

source: ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱས་ནས།
en: After he had taught them, led them to take the conversation to heart, given them cause to rejoice, and made them happy,

source: དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: he said to them,

source: གྲོགས་པོ་དག་གང་དག་ཆོས་ཉན་པར་དགའ་བ་རྣམས་དེ་ཡང་ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ། དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་དེང་ཤིག །
en: “Friends, those of you who wish to listen to the Dharma should go to the Tathāgata in the evening.”

source: དེ་སྐད་ཅེས་སྨྲས་ནས། ས་ཕྱོགས་དེ་ནས་ལངས་ཏེ། རང་རང་གི་གནས་ག་ལ་བ་དེ་ལོགས་སུ་སོང་ངོ་། །
en: After he had said this, they left that place, and all went their separate ways.

source: དེ་ནས་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་དང་། ཚོང་དཔོན་གྱི་བུ་འཇིགས་བྱིན་གཉིས་ལྷན་ཅིག་ཏུ་སྐྱེད་མོས་ཚལ་དུ་ཕྱིན་པ་དང་།
en: Then the courtesan’s daughter Suvarṇottama­prabhāśrī and the banker’s son Bhayadatta went to the park together.

source: དེར་མེ་ཏོག་གི་ཆལ་བར་བཀྲམ་སྟེ་བདུག་པས་བདུགས།
en: There were bouquets of flowers spread everywhere, giving off their fragrance.

source: བླ་རེ་བྲེས་ནས་གདུགས་དང་། རྒྱལ་མཚན་དང་།
en: There were awnings decorated with parasols, banners, and ensigns.

source: བ་དན་སྣ་ཚོགས་ཀྱིས་ལེགས་པར་བརྒྱན་ཏེབཟའ་བཏུང་འབྱོར་པ་དག་ཀྱང་བཤམས་ནས། དགའ་བའི་རྩེད་མོ་དང་རྗེས་སུ་འཐུན་པའི་སིལ་སྙན་དང་། ཕེག་རྡོབ་པར་གླུ་དབྱངས་ལེན་པར་བྱེད་ཅིང་སྐྱེད་མོས་ཚལ་ན་གནས་པར་གྱུར་ཏོ། །
en: They prepared riches of food and drink and stayed in the park and gathered around them drums large and small, cymbals, and songs for amusement.

source: དེ་དག་གིས་ཟོས་ཤིང་འཐུངས་ནས་རབ་ཏུ་མྱོས་པར་གྱུར་པ་དང་། སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ། ཚོང་དཔོན་གྱི་བུ་འཇིགས་བྱིན་གྱི་པང་པར་སྔས་བཅས་ཏེ་ཉལ་ལོ། །
en: Because they had eaten and drunk so much, they became quite intoxicated, and the courtesan’s daughter Suvarṇottama­prabhāśrī fell asleep on a pillow on the lap of Bhayadatta, the banker’s son.

source: དེ་ནས་བུ་མོ་དེས་མངོན་པར་ཤེས་པའི་སྟོབས་ཀྱིས་རང་གི་ལུས་རྙིས་པར་བསྟན་ནས། དེས་འཆི་བའི་འདུ་ཤེས་བསྐྱེད་དེ།
en: Then that girl, by means of her power of supernormal knowledge, made her body appear withered and gave the impression that she was dead.

source: དེའི་ལུས་ཐམས་ཅད་མི་སྡུག་པར་གྱུར་ནས། རོ་མྱགས་པ་འདྲ་བར་སྣང་ཞིང་
en: Her whole body became impure and appeared to be a rotting corpse.

source: དེའི་རྣ་བའི་བུ་ག་གཉིས་དང་། མིག་གི་དབང་པོ་དང་། སྣའི་ནང་ནས་མི་གཙང་བའི་དྲི་མི་ཞིམ་པ་དག་འབྱུང་ཞིང་བྱུང་ནས་ཀྱང་ལུས་ཐམས་ཅད་ལ་ཁྱབ་པར་གྱུར་ཏོ། །
en: Ill-smelling impurities emerged from the two openings of her ears, from her eyes, and from the inside of her nose, and spread all over her body.

source: དེའི་ཁའི་ནང་ནས་ཀྱང་དྲི་མནམ་པོ་དག་བྱུང་སྟེ། དྲི་མནམ་པོ་དེ་དག་གིས་སྐྱེད་མོས་ཚལ་དེ་ཐམས་ཅད་ཀྱང་ཁྱབ་པར་གྱུར་ཏོ། །
en: A foul odor issued from the inside of her mouth and filled the whole park.

source: སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་ཀྱང་ཁྲག་དང་རྣག་མནམ་པོ་དག་འཛག་གོ། །
en: Blood and pus flowed from every pore.

source: ལྟོ་བ་དང་ལྟེ་བའི་དབུས་རྡོལ་བ་ནས་ཀྱང་མཚེར་པ་དང་རྒྱུ་མ་ཐམས་ཅད་བྱུང་ངོ་། །
en: Her liver and all her intestines appeared from her abdomen, with her navel in the center.

source: རྐུབ་དང་མདོམས་ནས་ཀྱང་བཤང་གཅི་དག་འབྱུང་ཞིང་འཛག་གོ། །
en: Excrement and urine appeared and flowed out from her anus and her vulva.

source: དེའི་སྤྱི་བོ་ནས་ཀྱང་གླད་པ་འཛག་གོ། །
en: Her brains oozed out from her head, and

source: རྐང་ལག་གི་སོར་མོ་རྣམས་ལ་ཡང་སྦྲང་མ་སྔོན་པོ་དག་རྒྱུ་བར་གྱུར་ཏོ། །
en: blue flies began creeping over the nails of her feet and hands.

source: !དེ་ནས་ཚོང་དཔོན་གྱི་བུ་འཇིགས་བྱིན་གྱིས། བུ་མོ་དེའི་ལུས་ལ་དེ་ལྟ་བུའི་གནས་སྐབས་སུ་གྱུར་པ་དག་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་འཇིགས་སྐྲག་སྟེ་ཡི་ཆད་ཅིང་
en: Seeing what had happened to the girl's body, the banker's son Bhayadatta was seized by panic and terror.

source: སྐྱབས་མེད་རྟེན་མེད་དཔུང་གཉེན་མེད་པར་གྱུར་ནས། སྐྱབས་ཚོལ་ཞིང་
en: Having no protection or support, no one and nothing to turn to, he sought protection..

source: འཇིགས་པ་ཆེན་པོས་སྐྲག་པར་གྱུར་ནས་འདར་ཞིང་ཆོ་ངེས་འདེབས་པར་གྱུར་ཏོ། །
en: He was greatly frightened, and he trembled and cried bitterly.

source: དེ་འཇིགས་པ་ཆེན་པོ་སྐྱེས་པའི་རྒྱུ་ནི་གཉིས་ཏེ།
en: Such great fear arose in him for two reasons.

source: སོ་སོའི་སྐྱེ་བོ་ཉིད་ཡིན་པ་དང་། འཇིགས་པའི་སྐྱོན་དེ་དག་མཐོང་བའོ། །
en: He was an ordinary person outside the religious life, and he was aware of the crimes that are connected with such fear.

source: བདག་རེ་ཤིག་ན། བུ་མོ་འདིའི་ལེ་ལན་གྱིས། རྒྱལ་པོ་མ་སྐྱེས་དགྲས་བསད་པར་འོང་ངོ་སྙམ་ནས།
en: “As punishment for this girl’s fate, King Ajātaśatru will kill me,” he thought.

source: དེས་བུ་མོ་དེ་པང་པ་ནས་དོར་བ་དང་འབྲོས་པར་བཙལ་ནའང་མ་ནུས་སོ། །
en: He tried to move the girl off his lap and escape, but he was unable to.

source: དེའི་འཁོར་ཐམས་ཅད་ཀྱིས་ཀྱང་འཇིགས་སུ་རུང་བའི་འཇིགས་པ་ཆེན་པོ་དེ་མཐོང་ནས་བྲོས་པར་གྱུར་ཏོ། །
en: All of his companions saw his great and terrible fear and ran away.

source: དེ་ནས་དེ་གཅིག་པུ་གྲོགས་མེད་པར་དེ་ན་ཤིན་ཏུ་འཇིགས་ཤིང་སྐྲག་ནས། བདག་འཇིགས་སྐྲག་པ་ཆེན་པོ་འདི་ལས་ཡོངས་སུ་ཐར་བར་བྱེད་པ་ལྷའམ། ཀླུའམ། གནོད་སྦྱིན་ནམ། དྲི་ཟའམ། ལྷ་མ་ཡིན་ནམ། ནམ་མཁའ་ལྡིང་འམ། མིའམ་ཅིའམ། ལྟོ་འཕྱེ་ཆེན་པོའམ། མིའམ། མི་མ་ཡིན་པའམ། དགེ་སློང་ངམ། བྲམ་ཟེ་སུ་ཡོད་སྙམ་སེམས་ཤིང་འདུག་གོ། །
en: He sat there all alone and without friends, wondering, “Who is going to free me from this great fear that afflicts me—a god, a nāga, a yakṣa, a gandharva, a demigod, a garuḍa, a kiṃnara, a mahoraga, a human, a non-human being, a monk, or a brahmin?”

source: ཚོང་དཔོན་གྱི་བུ་དེ་ཡང་དགེ་བའི་རྩ་བ་ཡོངས་སུ་མ་སྨིན་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བུ་མོ་དེ་ལ་ཆོས་བཤད་པ་དག་ཀྱང་མ་ཐོས་མི་ཤེས་སོ། །
en: As the banker’s son’s roots of virtue had not yet matured, he had not heard the teaching that the princely Mañjuśrī had given to the girl, and he did not know it.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་བྱིན་གྱི་རླབས་ཀྱིས་སྐྱེད་མོས་ཚལ་དེའི་ཤིང་ལྗོན་པ་ཐམས་ཅད་ལས་ཚིགས་སུ་བཅད་པ་འདི་དག་བྱུང་ངོ་། །
en: Because of the magical presence of the princely Mañjuśrī, though, the following verses resounded from all the trees in the park:

source: འཇིག་རྟེན་ཐམས་ཅད་ཡང་དག་མིན། །
en: “All worlds are nonexistent.

source: ཇི་ལྟར་སྒྱུ་མ་མཐོང་བ་བཞིན། །
en: It is like seeing an illusion,

source: ཁྱེའུས་ཇི་ལྟར་མཐོང་གྱུར་པ། །ཆོས་རྣམས་རང་བཞིན་དེ་ཡིན་ནོ། །
en: But this boy sees phenomena As having an essential nature.

source: ཤ་དང་ཁྲག་གིས་བསྐུས་པ་ནི། །བྱིས་པ་རྣམས་ཀྱིས་འཁྲུལ་པ་སྟེ། །
en: “That which is clothed in flesh and blood Deceives the foolish.

source: ཡང་དག་མིན་དེར་རྣམ་བརྟགས་ནས། །མི་མཁས་བྱིས་པ་ཆགས་པར་བྱེད། །
en: The unwise and the childish imagine That the nonexistent is existent and become impassioned.

source: ཇི་ལྟར་མི་མཁས་མི་ཞིག་ནི། །དྲི་ང་སླ་ཙའི་བུམ་པ་ལ། །ཕྱི་རོལ་རི་མོ་བྲིས་པ་ཞིག །མགོ་ལ་ཁྱེར་ཏེ་སོང་བ་ལས། །
en: “One is like an unwise person Walking with a vase That has a nicely painted exterior But is full of foul-smelling filth.

source: འགྲོ་བ་དེ་ཡི་དེ་ཡང་ནི། །དེ་ལས་ལྷུང་སྟེ་ཆག་གྱུར་ནསདྲི་ང་སླ་ཙ་མཐོང་གྱུར་ཏེ། །ཆགས་པ་མེད་ཅིང་འབྲོས་པ་ལྟར། །
en: “While one is walking, however, the jar falls, And upon seeing the foul-smelling filth, All passion ceases and one runs away, Despite having been so impassioned before.

source: དེ་བཞིན་བྱིས་པ་མི་མཁས་པ། །བུད་མེད་རྣམས་ལ་ཡིད་ཞེན་ཅིང་། །ཁ་དོག་གཟུགས་དང་དབྱིབས་རྣམས་ལ། །བརྟགས་ནས་དེ་ལ་ཆགས་པར་བྱེད། །
en: “In the same way, the unwise and the foolish Become mentally impassioned— They become impassioned by imagining Color, beauty, and the appearance of women.

source: ལུས་ཀྱི་རང་བཞིན་གང་ཡིན་པ། །དེ་ལ་ཁྱེའུ་ཁྱོད་རབ་རྟོགས་ཤིག །
en: “But you, my boy, should understand The essential nature of the body.

source: དུར་ཁྲོད་རུལ་པའི་དྲི་ལ་ནི། །མཁས་པ་སུ་ཞིག་ཆགས་པར་འགྱུར། །
en: What wise man becomes impassioned By the rotten smell from a cemetery?

source: ཡང་དག་མིན་ལ་འཇིགས་མེད་ཀྱིས། །ཁྱོད་ནི་འཇིགས་པར་མ་བྱེད་པར། །
en: “Do not be afraid; there is no reason To be frightened by the nonexistent.

source: གང་ལ་ཁྱོད་སྔོན་བརྒྱལ་གྱུར་པའི། །ཆོས་རྣམས་ཀྱི་ནི་རང་བཞིན་ལྟོས། །
en: Look at the essential nature Of the things that used to depress you.

source: ཆོས་ཀྱི་དམ་པ་སྟོན་མཛད་ཅིང་། །འཇིགས་གྱུར་འཇིགས་པ་སེལ་མཛད་པ། །
en: “A wonderful teacher of the Dharma Clears away the fear of those who are afraid.

source: ཤཱཀྱ་སེང་གེ་ཞེས་བྱ་བའི། །སྟོན་པ་ཡང་དག་བྱུང་བ་ཡོད། །
en: A teacher whose name is The Lion of the Śākyas has appeared.

source: འདོད་པ་མི་རྟག་མི་བརྟན་པ། །གློག་འོད་སྣང་བ་ཇི་བཞིན་ཏེ། །
en: “Pleasure is impermanent and does not abide.

source: སྣང་ཡང་ཡང་དག་མ་ཡིན་པས། །མཁས་པ་དེ་ལ་ཆགས་པ་མེད། །
en: It is like a flash of lightning— Though it blazes up, it is not real, And the wise are not attached to it.

source: ཇི་ལྟར་ཆུ་ནི་འཁྲུགས་པ་ལས། །དབུ་བ་རྡོས་པ་བྱུང་བ་ཡང་། །རྒྱུ་ཡི་སྦྱོར་ལས་སྐྱེས་པ་སྟེ། །དེ་ལ་བྱེད་པ་པོ་ཡང་མེད། །
en: “Bubbles and foam Arise from turbulent waters, Arising in dependence on causes and circumstances, But with no agent to bring them about.

source: དེ་བཞིན་མིང་དང་གཟུགས་རྣམས་ཀྱང་། །ལས་ཀྱི་སྦྱོར་ལས་སྐྱེས་པ་སྟེ། །
en: “In just the same way, Names and forms arise from actions.

source: རྒྱུ་ལས་བྱུང་བ་ཡིན་པས་ན། །བྱེད་པ་པོ་ནི་གང་ཡང་མེད། །
en: They stem only from causes, But have no agent to bring them about.

source: ཁ་དོག་བཟང་པོ་གར་སོང་ཞིང་། །
en: “Where has the beautiful color gone?

source: གང་གིས་ཁྱོད་འདིར་སྐྲག་པ་ཡི། །མི་གཙང་བ་ཡང་ག་ལས་འོངས། །
en: And where do the impurities come from That frightened you so much just now?

source: ཁྱེའུ་ཁྱོད་དེ་ལ་མངོན་སུམ་གྱིས། །
en: That, my boy, is what you should realize.

source: ཆོས་རྣམས་ཡུལ་ན་མི་གནས་ཤིང་། །
en: “Phenomena are not found in the outside world, And

source: དེ་དག་ཕྱོགས་ནས་འོང་བ་མེད། །
en: they do not come from any direction.

source: འོང་བ་མེད་ཅིང་འགྲོ་མེད་ཀྱང་། །
en: They are beyond both coming and going,

source: དེ་དག་རང་བཞིན་སྟོན་པར་བྱེད། །
en: And you should understand their essential nature.

source: འདི་ལ་བྱེད་པ་པོ་མེད་ཅིང་། །ཚོར་བ་པོ་ཡང་འདི་ལ་མེད། །བྱེད་མེད་ཚོར་བ་པོ་མེད་པའི། །ཆོས་རྣམས་སྒྱུ་འདྲ་དངོས་པོ་མེད། །
en: “There is no subject that acts or feels, And phenomena, Which have no subject that acts or feels, Are like illusions and not existent things.

source: རང་གི་ལུས་ལ་རྟོགས་ཤིག་དང་། །དེ་ཡང་འདི་དང་འདྲ་བས་ན། །ཁྱེའུ་ཁྱོད་གཞན་གྱི་ལུས་ཀྱིས་ནི། །འདིར་ཡང་སྐྲག་པར་མ་བྱེད་ཅིག །
en: “Understand your own body In this way, and you Should not be frightened By the body of another.

source: ཇི་ལྟར་རྨི་ལམ་རྨིས་པ་ན། །རྩེད་མོ་བྱེད་ཅིང་དགའ་བ་ལྟར། །དེ་བཞིན་དགའ་བའི་རྩེད་མོ་ཀུན། །རྨི་ལམ་རྩེད་མོ་བྱས་དང་འདྲ། །
en: “Just as one experiences amorous play And pleasure when one dreams, All amorous pleasure and play is like That amorous play one experiences in a dream.

source: ཤཱཀྱ་སེང་གེའི་སྤྱན་སྔར་ནི། །ཁྱེའུ་ཁྱོད་འགྲོ་བར་གྱིས་ཤིག་དང་། །
en: “So, my boy, go to The Lion of the Śākyas, And

source: དེས་ནི་ཁྱེའུ་ཁྱོད་འཇིགས་དང་སྐྲག །རྩ་དང་བཅས་ཏེ་འབྱིན་པར་འགྱུར། །
en: he will pull your fear and terror Up by their roots.

source: ཕ་མ་ཁྱོད་ཀྱི་སྐྱབས་མ་ཡིན། །མཛའ་བཤེས་རྩ་ལག་རྣམས་ཀྱང་མིན། །
en: “Your father and mother are no longer your protection, Nor are your friends and relatives.

source: དེ་དག་གིས་ནི་ཁྱོད་བོར་ནས། །ཇི་ལྟར་འདོད་པ་བཞིན་དུ་འགྲོ། །
en: When they have left you, How can you do what you wish?

source: འཇིགས་གྱུར་འཇིགས་པ་སེལ་མཛད་ཅིང་། །སྐྱབས་མེད་སྐྱོབས་པའི་སངས་རྒྱས་དང་། །ཆོས་དང་ཚོགས་མཆོག་དགེ་འདུན་ལ། །
en: “So go for protection to the one Who clears away the fear of those who are afraid, The Awakened One who is the protector of the unprotected, To the Dharma, and to the Supreme Assembly.

source: དེར་ནི་སྐྱབས་སུ་འགྲོ་བར་གྱིས། །ལྷ་དང་དྲི་ཟ་མི་རྣམས་ལས། །གང་དག་དེ་ལ་སྐྱབས་སོང་བ། །འཇིགས་པ་ཀུན་ལས་ཐར་བར་འགྱུར། །བདེ་བ་རྙེད་པར་དཀའ་བ་མེད། །
en: “Those who go to him for protection— Be they gods, gandharvas, or humans— Are liberated from every fear, And happiness is not hard for them to obtain.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་དེས་ཚིགས་སུ་བཅད་པ་དེ་དག་ཐོས་ནས། དགའ་མགུ་ཞིང་ཡི་རངས་ཏེ།
en: When the banker’s son had heard those verses, he felt happy and rejoiced.

source: འཇིགས་སྐྲག་པ་དང་བྲལ་ནས་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་སྐྱེས་ཏེ།
en: He had gotten rid of his fear, and he felt joy.

source: ཤི་བའི་རོ་མྱགས་པ་དེ་བོར་ནས་ནགས་ཁྲོད་དེ་ནས་བྱུང་ངོ་། །
en: Overjoyed, he cast the rotting corpse aside and left the park.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་དེ་གདུལ་བའི་དབང་གི་ཕྱིར་སྐུ་ལས་འོད་རབ་ཏུ་ཕྱུང་སྟེ། འོད་དེས་ཡུལ་མ་ག་དྷཱ་ཐམས་ཅད་སྣང་བས་ཁྱབ་པར་གྱུར་ཏོ། །
en: Then the Blessed One emitted a ray of light from his body in order to educate the banker’s son, and the whole land of Magadha was filled with that light.
